Olegkg2018/smart-speaker/firmware/sdkconfig.defaults
# ESP32-S3 N16R8: 16 МБ флеша, 8 МБ PSRAM в octal-режиме.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Своя разметка флеша: стандартная даёт приложению 1 МБ, а с эхоподавлением
# и активационным словом оно туда не помещается. Плюс ESP-SR требует
# отдельный раздел model для своих моделей.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Активационное слово ищет сам ESP32: сервер перестаёт круглосуточно
# принимать поток по Wi-Fi и считать распознавание. Английское слово
# надёжнее русского — модель обучена именно на нём.
CONFIG_SR_WN_WN9_COMPUTER_TTS=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Wi-Fi: увеличенные буферы заметно снижают джиттер аудиопотока.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# Энергосбережение добавляет задержку пакетам — для голоса это слышно.
CONFIG_ESP_WIFI_PS_NONE=y

# WebSocket-клиент из esp-protocols.
CONFIG_ESP_WEBSOCKET_CLIENT_ENABLE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y
